# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv
file_name, time, salary, bonus = argv

payment = (int(time) * int(salary)) + int(bonus)
print(f"Заработная плата равна: {payment}")
